In [1]:
%load_ext sql
%sql sqlite:///sql-murder-mystery.db

<img src='question.png'>
<img src='diagram.png'>

In [2]:
%%sql select *
from crime_scene_report
where date == 20180115 and type == 'murder'

 * sqlite:///sql-murder-mystery.db
Done.

[(20180115, 'murder', 'Life? Dont talk to me about life.', 'Albany'),
 (20180115, 'murder', 'Mama, I killed a man, put a gun against his head...', 'Reno'),
 (20180115, 'murder', 'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".', 'SQL City')]

In [3]:
%%sql select *
from person
where address_street_name == 'Northwestern Dr'
order by address_number DESC LIMIT 1

 * sqlite:///sql-murder-mystery.db
Done.

[(14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', 111564949)]

In [4]:
%%sql select *
from person
where address_street_name == 'Northwestern Dr'
order by address_number ASC LIMIT 1

 * sqlite:///sql-murder-mystery.db
Done.

[(89906, 'Kinsey Erickson', 510019, 309, 'Northwestern Dr', 635287661)]

In [5]:
%%sql select *
from person
where (name LIKE '%Annabel%')&(address_street_name == 'Franklin Ave')

 * sqlite:///sql-murder-mystery.db
Done.

[(16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', 318771143)]

In [6]:
%%sql select person_id, name
from get_fit_now_member
where name like 'Morty Schapiro' or name like 'Kinsey Erickson'or name like 'Annabel Miller'

 * sqlite:///sql-murder-mystery.db
Done.

[(16371, 'Annabel Miller')]

In [7]:
%%sql select *
from person as p
join interview as i
on p.id == i.person_id
where name like 'Morty Schapiro' or name like 'Kinsey Erickson'or name like 'Annabel Miller'

 * sqlite:///sql-murder-mystery.db
Done.

[(14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', 111564949, 14887, 'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'),
 (16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', 318771143, 16371, 'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.')]

In [8]:
%%sql select *
from get_fit_now_member
where membership_start_date < 20170109

 * sqlite:///sql-murder-mystery.db
Done.

[('2Q45D', 47693, 'Owen Caston', 20170102, 'silver'),
 ('GKZV7', 30221, 'Jude Fairbairn', 20170108, 'gold'),
 ('402DQ', 92379, 'Lynwood Punter', 20170104, 'silver'),
 ('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold'),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold'),
 ('90081', 16371, 'Annabel Miller', 20160208, 'gold')]

In [9]:
%%sql select *
from get_fit_now_member as nm
join get_fit_now_check_in as ci
on nm.id == ci.membership_id
where (check_in_date == 20180109) AND (membership_id like '48Z%')

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold', '48Z7A', 20180109, 1600, 1730),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold', '48Z55', 20180109, 1530, 1700)]

In [10]:
%%sql select *
from person as p
join drivers_license as dl
on p.license_id == dl.id
where plate_number like '%H42W%'

 * sqlite:///sql-murder-mystery.db
Done.

[(51739, 'Tushar Chandra', 664760, 312, 'Phi St', 137882671, 664760, 21, 71, 'black', 'black', 'male', '4H42WR', 'Nissan', 'Altima'),
 (67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', 871539279, 423327, 30, 70, 'brown', 'brown', 'male', '0H42W2', 'Chevrolet', 'Spark LS'),
 (78193, 'Maxine Whitely', 183779, 110, 'Fisk Rd', 137882671, 183779, 21, 65, 'blue', 'blonde', 'female', 'H42W0X', 'Toyota', 'Prius')]

## The killer is Jeremy Bowers